# -*- coding: utf-8 -*-
"""3лаба.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1_BXrcl_TAtYfqteJNNRrBp0HF553TN1P

Задача 1: Календарь
"""

month_number = int(input("Введите номер месяца (1-12): "))
if month_number == 1:
    print("Январь")
elif month_number == 2:
    print("Февраль")
elif month_number == 3:
    print("Март")
elif month_number == 4:
    print("Апрель")
elif month_number == 5:
    print("Май")
elif month_number == 6:
    print("Июнь")
elif month_number == 7:
    print("Июль")
elif month_number == 8:
    print("Август")
elif month_number == 9:
    print("Сентябрь")
elif month_number == 10:
    print("Октябрь")
elif month_number == 11:
    print("Ноябрь")
elif month_number == 12:
    print("Декабрь")
else:
    print("Ошибка: введите число от 1 до 12")

Задача 2: Чётное/нечётное

number = int(input("Введите число: "))

if number % 2 == 0:
    print("Число чётное")
else:
    print("Число нечётное")

"""Задача 3: Stonks/Not stonks"""

N = float(input("Введите число N: "))

if N > 40:
    print("stonks")
else:
    print("not stonks")

"""Задача 4: Високосный год"""

def is_year_leap(year):
    if year % 4 != 0:
        return False
    elif year % 100 != 0:
        return True
    elif year % 400 != 0:
        return False
    else:
        return True

year = int(input("Введите год: "))
if is_year_leap(year):
    print(f"{year} год - високосный")
else:
    print(f"{year} год - не високосный")

"""Задача 5: Простое число"""

def is_prime(n):
    if n <= 1:
        return False
    elif n == 2:
        return True
    elif n % 2 == 0:
        return False
    else:
        i = 3
        while i * i <= n:
            if n % i == 0:
                return False
            i += 2
        return True

n = int(input("Введите число: "))
if is_prime(n):
    print(f"{n} - простое число")
else:
    print(f"{n} - составное число")

"""Задача 6: Обмен значений переменных"""

a = float(input("Введите a: "))
b = float(input("Введите b: "))

print(f"Было: a={a}, b={b}")

if a > b * 3.6:
    a, b = b, a
    print("Обмен по условию 1")
else:
    low = (abs(-69)) ** 1.3
    high = abs((-69 / (28 ** 5.1)) * 4)

    print(f"Границы: low={low}, high={high}")

    if b >= low and b <= high:
        a, b = b, a
        print("Обмен по условию 2")
    else:
        print("Обмен не требуется")

print(f"Стало: a={a}, b={b}")

"""Задача 7: Анализ 5 чисел"""

print("Введите 5 чисел:")
numbers = []
for i in range(5):
    num = float(input(f"Число {i+1}: "))
    numbers.append(num)

if len(numbers) == len(set(numbers)):
    print("Все числа уникальны")
else:
    print("Есть повторяющиеся числа")

even_count = 0
negative_count = 0
in_range_count = 0

for num in numbers:
    if num % 2 == 0:
        even_count += 1

    if num < 0:
        negative_count += 1

    if -256 <= num <= 1024:
        in_range_count += 1

print(f"Количество чётных чисел: {even_count}")
print(f"Количество отрицательных чисел: {negative_count}")
print(f"Количество чисел в промежутке [-256; 1024]: {in_range_count}")